"""
Равлик повзе по вертикальній жердині висотою h метрів, піднімаючись
за день на a метрів, а за ніч спускаючись на b метрів.
На який день равлик доповзе до вершини жердини? Дані вводяться у порядку h, a, b.
10 3 2
8
"""

h, a, b = map(int, input().split())

if a >= h:
    print(1)
else:
    need = h - a        # скільки метрів треба пройти до останнього дня
    step = a - b        # скільки проходить за день+ніч

    days = need // step
    if need % step != 0:
        days += 1

    print(days + 1)     # додаємо останній день
