"""
В IT компанії працює N співробітників.
Р є програмістами, Т – тестувальники.
Назвемо співробітника універсалом, якщо він є одночасно
і програмістом і тестувальником.
Знайдіть мінімальну та максимальну можливу
кількість універсалів у компанії.
Дано три натуральних числа
 N,	P,	T	(1	≤	P,	T	≤	N	≤	1018) –
кількість співробітників,
кількість програмістів і кількість тестувальників відповідно.
10 10 10     10 10
10 2 5        0 2
"""
n,p,t = map(int, input().split())
max_universal = min(p,t)
min_universal = min(p,t) -(n-max(p,t))
if min_universal < 0:
    min_universal = 0
print(min_universal, max_universal)

