"""
Розглянемо алгоритм, який на входi отримує натуральне число n i, якщо n парне, алгоритм
дiлить його на два, а якщо n непарне, алгоритм множить його на три та додає одиницю.
Алгоритм повторює це, поки n не стане одиницею.
Наприклад, послiдовнiсть для n = 3 така:
3→10→5→16→8→4→2→1
Ваше завдання - змоделювати виконання алгоритму для заданого значення n.
Input:
3
Output:
3 10 5 16 8 4 2 1
"""
n = int(input())
print(n, end=' ')
while n > 1:
    if n%2 == 0:
        n //=2
    else:
        n = n*3 + 1
    print(n, end=' ')