"""
Задача A. Алфавiтнi слова
Назва вхiдного файлу: standard input
Назва вихiдного файлу: standard output
Лiмiт часу: 1 second
Лiмiт використання пам’ятi: 256 megabytes
Задано рядок, який мiстить вiд 2 до 50 слiв, в кожному вiд 1 до 30 лiтер
з промiжку ’a’..’z’.
Вивести всi слова, в яких символи впорядкованi за алфавiтом.
Формат вхiдних даних
Один рядок, який мiстить вiд 2 до 50 слiв, роздiлених одним пропуском.
 Рядок мiстить тiльки
лiтери з промiжку ’a’..’z’ i пропуски.
Формат вихiдних даних
Вивести в кожному новому рядку слово, лiтери в якому розмiщенi за алфавiтом. Слова виводити
в тому порядку, в якому вони розмiщенi в рядку.
Input:
there is the house where my family lives
Output:
is
my
"""
words = input().split()
for word in words:
    for i in range(len(word)-1):
        if word[i] > word[i+1]:
            break
    else:
        print(word)

